tests/artillery.test.yaml
config:
  target: "http://127.0.0.1:8010"
  phases:
    - duration: 30
      arrivalRate: 120
  ensure:
    p99: 50
scenarios:
  - flow:
      - post:
          url: "/rides"
          json:
            start_lat: -90
            start_long: -180
            end_lat: 90
            end_long: 180
            rider_name: "Hashcode"
            driver_name: "Leke"
            driver_vehicle: "Benz"
          capture:
            json: "$.rideID"
            as: "rideID"
      - get:
          url: "/rides/{{ rideID }}"
      - get:
          url: "/rides"